Repository: pypi-data/pypi-mirror-56
Catalog: packages/apidev-coop-cms/apidev-coop_cms-1.5.1.tar.gz/apidev-coop_cms-1.5.1/coop_cms/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Clear thumbnails
fr: Réinitailiser les miniatures

source: All
fr: Tous

source: navigable types
fr: types navigables

source: General
fr: Général

source: Settings
fr: Réglages

source: Advanced
fr: Avancé

source: Content
fr: Contenu

source: Media filter
fr: Filtre Média

source: Is duplicated
fr: est duppliqué

source: Yes
fr: Oui

source: No
fr: Non

source: Cancel
fr: Annuler

source: Save
fr: Enregistrer

source: Page not found
fr: Page introuvable

source: Error 404
fr: Erreur 404

source: The request page can't be found on the server. Please check it
fr: La page ne peut pas être trouvée sur le serveur. Veuillez vérifiez l'URL demandée.

source: Server Error
fr: Erreur Interne

source: Sorry! we can not process your request. The server encountered an error.
fr: Désolé nous ne pouvons pas traiter votre demande. Une erreur est survenue.

source: We've been informed and we will make our best to fix the problem as soon as possible
fr: Nous avons été informé et nous essaierons de corriger le problème dès que possible.

source: Please retry in a short while or go back to the
fr: Veuillez réessayer dans un instant ou retournez à la

source: homepage
fr: page d'accueil

source: Homepage
fr: Accueil

source: Author
fr: Auteur

source: Please enter a correct %(email)s and password. Note that both fields may be case-sensitive.
fr: Veuillez entrer un %(email)s valide et un mot de passe. Notez que ces 2 champs sont sensibles à la casse.

source: I have read and agree to the Terms of Service
fr: J'accepte les conditions d'utilisation

source: You must agree to the terms to register
fr: Vous devez accepter les conditions d'utilisation

source: Account created
fr: Compte créé

source: Account activated
fr: Compte activé

source: A new user has activated his account
fr: Un nouvel utilisateur a activé son compte

source: A new user has registred
fr: Un nouvel utilisateur s'est inscrit

source: Newsletters
fr: Lettres d'information

source: Reason
fr: Raison

source: last name
fr: nom

source: first name
fr: prénom

source: email verified
fr: émail vérifié

source: unique identifier
fr: identifiant unique

source: favorite language
fr: langue préférentielle

source: name
fr: nom

source: order index
fr: ordre

source: From email
fr: Email expéditeur

source: language
fr: Langue

source: Subscription type
fr: Type d'inscription

source: Subscription types
fr: Types d'inscription

source: accept subscription
fr: inscription acceptée

source: Keep this checked if you want to receive our newsletter.
fr: Garder coché pour recevoir la newsletter

source: Edition in progress
fr: Edition en cours

source: Sending is scheduled
fr: Envoi programmé

source: Sending in progress
fr: Envoi en cours

source: Sent
fr: Envoyé

source: creation date
fr: Date de création

source: scheduling date
fr: date prévue pour l'envoi

source: sending date
fr: date d'envoi

source: Magic link
fr: Lien magique

source: Magic links
fr: liens magiques

source: Default
fr: Défault

source: If you can't view this email,
fr: Si vous ne pouvez lire cet e-mail

source: read the online version
fr: lire la version en ligne

source: this link
fr: ce lien

source: Unregister
fr: Se désinscrire

source: Are you sure to unregister from our mailing-list?
fr: Etes-vous sûr de vouloir vous désinscrire de notre newsletter?

source: You have been unregistered from our mailing-list.
fr: Vous êtes à présents désinscrits de notre newsletter.

source: You have cancelled the operation. You are still member of our mailing-list.
fr: Vous avez annulé l'opération. Vous êtes toujours inscrit à notre newsletter.

source: English
fr: Anglais

source: American
fr: Américain

source: Russian
fr: Russe

source: Activate
fr: Activer

source: Login
fr: Connexion

source: If you did not request this account creation, please ignore this email.
fr: Si vous n'avez pas demandé la création d'un compre, merci d'ignorer cet email.

source: Account activation
fr: Activation du compte

source: You've been logged out
fr: Vous avez été déconnecté

source: You are going to be redirected to the
fr: Vous allez être redirigé vers

source: Login has failed
fr: La connexion a échoué

source: Password
fr: Mot de passe

source: Forgotten Password
fr: Mot de passe oublié

source: The password has been changed
fr: Le mot de passe a été modifié

source: Go back to the
fr: Retour à la

source: Password modification
fr: Modification de mot de passe

source: Change password
fr: Modifier le mode de passe

source: Click Here
fr: Cliquer ici

source: Password reset
fr: Réinitialisation de mot de passe

source: Reset
fr: Réinitialiser

source: An Email has been sent
fr: Un email a été envoyé

source: It contains the procedure to reset the password.
fr: Il contient la procédure de réinitialisation du mot de passe

source: Registration complete
fr: Inscription réussie

source: We sent you an email. It will help you to activate your account.
fr: NOus vous avons envoyé un email. Il vous permettra d'activer votre compte

source: * : required field
fr: * : champ requis

source: Registration
fr: Inscription

source: Terms of use
fr: Conditions d'utilisation

source: Go back to login page
fr: Retour à la page d'accueil

source: Register
fr: S'inscrire

source: Article admin
fr: Admin de l'article

source: Add {0}
fr: Ajout {0}

source: List {0}
fr: Liste {0}

source: Navigation tree
fr: Arborescence

source: Navigation trees
fr: Arborescences

source: Media library
fr: Médiathèque

source: Add image
fr: Ajouter une image

source: Update logo
fr: Mettre à jour le logo

source: Add document
fr: Ajouter un document

source: Add article
fr: Ajouter un article

source: Add link
fr: Ajouter un lien

source: Set homepage
fr: Définir la page d'accueil

source: Article settings
fr: Réglages article

source: Edit
fr: Editer

source: Draft
fr: Brouillon

source: Published
fr: Publié

source: Log out
fr: Déconnexion

source: Create newsletter
fr: Créer une lettre d'info

source: Articles ordering
fr: Ordre des articles

source: Newsletter settings
fr: Réglages lettre

source: Convert to Pdf
fr: Convertir en Pdf

source: Send test
fr: Test envoi

source: Add fragment
fr: Ajouter un fragment

source: Edit fragments
fr: Editer les fragments

source: Switch language
fr: Changer de langue

source: Title can not be empty
fr: Le titre ne peut pas être vide

source: It is recommended to keep the current site.
fr: Il est recommandé de garder le site en cours

source: Optional description
fr: Description optionelle

source: Filters
fr: Filtres

source: Choose between tags to find images more easily
fr: Sélectionner un filtre qui rendra les images plus faciles à trouver

source: Size
fr: Taille

source: Define a size if you want to resize the image
fr: Definissez une taille pour l'image

source: Invalid choice
fr: Choix invalide

source: Select CSS classes to apply
fr: Sélectionner les classes CSS à appliquer

source: Invalid class '{0}'
fr: Classe CSS invalide '{0}'

source: A fragment with this name already exists
fr: Il existe déjà un fragment avec ce nom

source: delete
fr: supprimer

source: Invalid rule for this content type: The object class doesn't have a get_label method
fr: Règle invalide pour ce content type: La classe de l'objet n'a pas de méthode get_label

source: <not in navigation>
fr: < pas dans l'arborescence >

source: Select an article
fr: Choisir un article

source: This field is required
fr: Ce champ est requis

source: The scheduling date must be in future
fr: La date d'envoi doit être dans le futur

source: Language
fr: Langue

source: The object has been saved properly
fr: L’objet a été enregistré avec succès

source: An error occurred: {0}
fr: Une erreur est survenue: {0}

source: The objects have been saved properly
fr: L’objet a été enregistré avec succès

source: Index error in formset: some objects may be missing
fr: Erreur: des objets peuvent manquer

source: An error occured: At least one object is missing. Please try again.
fr: Erreur: Au moins un objet est manquant. Veuillez réessayer.

source: The slug must only contains letters, numbers or hyphens
fr: Le slug doit seulement contenir des lettres, des chiffres ou des tirets (-)

source: Node
fr: Noeud

source: Use object unicode
fr: Utiliser l'unicode de l'objet

source: Use search field
fr: Utiliser le champ search

source: Use get_label
fr: Utiliser la méthode get_label

source: django model
fr: modèle django

source: search field
fr: le champ de recherche

source: How to generate the label
fr: Comment générer le label

source: navigable type
fr: type navigable

source: root nodes
fr: racines

source: tree
fr: arbre

source: label
fr: libellé

source: ordering
fr: ordre

source: content_type
fr: type de contenu

source: object id
fr: identifiant de l'objet

source: in navigation
fr: visible dans la navigation

source: navigation node
fr: noeud de navigation

source: navigation nodes
fr: noeuds de navigation

source: A node can not be its own parent
fr: Un élément ne peut pas être son propre parent

source: A node can not be child of its own child
fr: Un élément ne peut pas être son propre enfant

source: in rss
fr: flux rss

source: The articles of this category will be listed in the main rss feed
fr: Les articles de cette catégorie seront listés dans le flux rss

source: pagination size
fr: nb elements pagination

source: The number of articles to display in a category page. If 0, use default
fr: Le nombre d'articles à afficher dans une page de catégorie. Si 0, utilise la valeur par défault

source: article category
fr: catégorie d'article

source: article categories
fr: catégories d'article

source: set the parent in navigation.
fr: ajouter l’élément à la navigation.

source: Archived
fr: Archivé

source: title
fr: titre

source: subtitle
fr: sous-titre

source: content
fr: contenu

source: template
fr: modèle

source: Summary
fr: Résumé

source: Category
fr: Catégorie

source: In newsletter
fr: Lettre d'info

source: Make this article available for newsletters.
fr: rendre cet article disponible pour insertion dans une lettre d'information

source: Homepage for site
fr: Accueil du site

source: Headline
fr: à la une

source: Make this article appear on the home page
fr: Faire apparaitre cet article à la une du site

source: Publication date
fr: Date de publication

source: login required
fr: Login requis

source: If true, only user with login/password will able to access the article
fr: Si vrai, seulement un utilisateur avec un login/mod de passe pourra accéder à cet article

source: No Image
fr: Pas d'image

source: Title
fr: Titre

source: link
fr: lien

source: links
fr: liens

source: media filter
fr: filtre de média

source: media filters
fr: filtres de médias

source: size
fr: taille

source: crop
fr: découpage

source: Image size
fr: Taille d'image

source: Image sizes
fr: Tailles d'images

source: filters
fr: filtres

source: file
fr: fichier

source: is private
fr: privé

source: Check this if you do not want to publish this document to all users
fr: Cocher cette case si vous -ne voulez pas- publier ce document à tous les utilisateurs

source: category
fr: catégorie

source: extra identifier
fr: extra id

source: piece of HTML
fr: bloc HTML

source: pieces of HTML
fr: blocs HTML

source: newsletter item
fr: élément de lettre d'information

source: newsletter items
fr: éléments de lettre d'information

source: subject
fr: sujet

source: source url
fr: url source

source: is_public
fr: est public

source: newsletter date
fr: date de la lettre d'information

source: newsletter
fr: lettre d'information

source: newsletters
fr: lettres d'information

source: newsletter sending
fr: Envoi de lettre d'information

source: newsletter sendings
fr: Envois de lettre d'informations

source: Aliases
fr: Alias

source: allowed css classes
fr: classes CSS autorisées

source: the css classed proposed when editing a fragment. It must be separated by comas
fr: Définit les classes CSS qui sont autorisées pour ce type de fragments. Les valeurs doivent être séparées par des virgules.

source: Fragment type
fr: Type de fragment

source: Fragment types
fr: types de fragments

source: Fragment filter
fr: Filtre de fragment

source: Fragment filters
fr: Filtres de fragments

source: fragment type
fr: type de fragment

source: CSS class
fr: classe CSS

source: fragment filter
fr: filtre de fragment

source: Only site articles
fr: Seulement les articles du site

source: All articles
fr: Tous les articles

source: site settings
fr: Réglages article

source: homepage URL
fr: URL de la page d'accueil

source: if set, the homepage will be redirected to the given URL
fr: si défini, la page d'accueil redirigera vers l'URL

source: homepage article
fr: article d'accueil

source: if set, the homepage will get the article with the given slug
fr: si défini, la page d'accueil retournera l'article avec le slug donné

source: Sites settings
fr: Réglages site

source: Site settings
fr: Réglages site

source: The current site is NOT localhost (127.0.0.1:8000). Do you want to turn it into localhost?
fr: Le site actuel n'est pas en localhost (127.0.0.1:8000). Voulez-vous modifier la configuration en localhost?

source: 0: No 1: Yes
fr: 0: Non 1: Oui

source: Nothing has changed
fr: Aucune modification n'a été apportée

source: Your domain site is now:
fr: Votre domaine est à présent:

source: Are you sure to delete the selected node?
fr: Etes-vous sur de vouloir supprimer l’élément sélectionné ?

source: Home
fr: Accueil

source: Add
fr: Ajouter

source: The site requires javascript to be enabled!
fr: Le site nécessite l'activation de javascript

source: Add a new node
fr: Ajouter un nouvel élément

source: Rename this node
fr: Renommer cet élément

source: Navigation
fr: Arborescence

source: Remove this node
fr: Supprimer cet élément de l’arborescence

source: Please correct the error below.
fr: Veuillez corriger l'erreur ci-dessous

source: An error occured
fr: Une erreur est survenue

source: By accessing our website, you accept cookies
fr: En accédant à notre site Internet, vous reconnaissez accepter les cookies.

source: Hide this message
fr: Ne plus afficher ce message

source: Your modifications are not saved and will be lost. Continue?
fr: Vos modifications n'ont pas été enregistrées et seront perdues. Continuer?

source: It is possible that you disabled cookies for this site. <br /><br /> Cookies must be enabled in order to be able to use this site properly.
fr: Peut-être avez vous désactivé l'utilisation des cookies ce qui cause ce problème. <br /><br /> Les cookies doivent être activés pour que ce site fonctionne correctement.

source: If you have configured your browser to disable 'Referer' headers, please re-enable them, at least for this site or for 'same-origin' requests.
fr: Si vous avez configuré votre navigateur pour désactiver les entêtes de type 'Referer' , merci de le réactiver, au moins pour ce site ou pour les requêtes de 'même-origin' requests.

source: Unknown reason: Please contact the webmaster in order to define the cause of the problem.
fr: Raison inconnue: Veuillez contacter le webmaster du site afin de définir la cause du problème.

source: close
fr: fermer

source: Read more
fr: Suite

source: Share on twitter
fr: Partagez sur twitter

source: Share on Facebook
fr: Partagez sur Facebook

source: Permission Denied
fr: Permission refusée

source: Hide galleries
fr: Cacher les gallerie

source: Show galleries
fr: Montrer les galleries

source: Edit on site
fr: Editer sur le site

source: This article is draft
fr: Cet article est un brouillon

source: This article is not accessible
fr: Cet article n'est pas accessible

source: Hide node in navigation
fr: Masquer cet élément

source: Show node in navigation
fr: Rendre visible cet élément

source: Empty node
fr: Noeud vide

source: Edit in admin
fr: Editer dans l'admin

source: View on site
fr: Voir sur le site

source: Change the newsletter template
fr: Changer de modèle de lettre d'information

source: Change the article template
fr: Changer de modèle de page

source: New article
fr: Nouvel article

source: New link
fr: Nouveau lien

source: Edit newsletter settings
fr: Réglages lettre d'info

source: New newsletter
fr: Nouvelle lettre d'info

source: The article is a draft. By clicking "Publish", you will make it visible to anybody.
fr: L'article est un brouillon. En cliquant "Publier", vous le rendrez visible de tous sur le site.

source: The article is published. If you click "Draft", it will not be visible anymore. Only staff members will be able to see it.
fr: L' article est publié. Si vous cliquer sur "Brouillon", il ne sera plus visible sur le site. Seul les utilisateurs autorisés pourront le voir.

source: Publish
fr: Publier

source: Schedule newsletter sending
fr: Programmer l'envoi de la lettre

source: Test newsletter
fr: Lettre d'information de test

source: Change article logo
fr: Changer le logo de l'article

source: Upload document
fr: Ajouter un document

source: Upload image
fr: Ajouter une image

source: <h1>Welcome on coop_cms</h1> <p> coop_cms is a simple CMS for the Django web framework.<br/> The goal is to make article edition as simple as possible thanks to HTML5 content editable and Aloha editor. </p>
fr: <h1>Bienvenue sur coop_cms</h1> <p> coop_cms est un CMS simple pour l'environnement de développement Django.<br/> Son but est de rendre l'édition d'article aussi simple que possible grâce à Aloha editor et à la balise HTML5 "content-editable". </p>

source: View all articles
fr: Voir tous les articles

source: View all newsletters
fr: Voir toutes les lettres d'information

source: Create a newsletter
fr: Créer une lettre d'information

source: Translate this string for test
fr: Traduit cette chaine pour test

source: [DRAFT]
fr: [BROUILLON]

source: [ARCHIVED]
fr: [ARCHIVÉ]

source: navigation_breadcrumb requires object as argument
fr: navigation_breadcrumb requiert un objet en argument

source: navigation_children requires object as argument and optionally tree={{tree_name}}
fr: navigation_children requiert un objet en argument

source: navigation_siblings requires object as argument
fr: navigation_siblings requiert un objet en argument

source: Do you want to publish this article?
fr: Voulez-vous publier cet article ?

source: Make it draft?
fr: Voulez-vous passez en mode brouillon?

source: The article has been created properly
fr: L’article a été créé avec succès

source: Edit fragments of this template?
fr: Editer les fragments de ce template

source: Do you want to use this article as homepage?
fr: Voulez-vous utiliser cet article comme page d'accueil ?

source: The link has been created properly
fr: Le lien a été créé avec succès

source: The node '{0}' has been renamed into '{1}'.
fr: L’élément '{0}' a été renommé en '{1}'.

source: The node has been removed.
fr: L’élément a été supprimé

source: {0} nodes has been removed.
fr: {0} éléments ont été supprimés

source: The node '{0}' has been moved.
fr: L'élément '{0}' a été déplacé

source: Please choose an existing {0}
fr: Veuillez choisir un {0} existant

source: {0} {1} not found
fr: {0} {1} est introuvable

source: The {0} is already in navigation
fr: Le {0} est déjà dans l’arborescence

source: '{0}' has added to the navigation tree.
fr: '{0}' ajouté à l’arborescence.

source: The node is now visible.
fr: l’élément est à présent visible dans l’arborescence.

source: The node is now hidden.
fr: Cet élément est maintenant masqué.

source: The test email has been sent to {0} addresses: {1}
fr: L'email de test a été envoyé à {0} adresses: {1}

source: An error occured! Please contact your support.
fr: Une erreur est intervenue, contactez le support technique.

source: Lookup
fr: Recherche
