Repository: pypi-data/pypi-mirror-56
Catalog: packages/fsfe-reuse/fsfe-reuse-0.6.0.tar.gz/fsfe-reuse-0.6.0/po/*.po
Languages: eo

source: could not find Git
eo: ne povis trovi programaron Git

source: yielding %s
eo: traktante %s

source: currently walking in %s
eo: ĉimomente irante en %s

source: ignoring %s
eo: ignoras %s

source: searching %s for reuse information
eo: serĉanta en %s por reuse-informoj

source: %s could not be decoded
eo: ne povis malkodi %s

source: %s covered by debian/copyright
eo: debian/copyright ampleksas al %s

source: Could not read %s
eo: Ne povis legi %s

source: {path} is licensed under {identifier}, but its license file could not be found
eo: {path} subas permesilon {identifier}, sed ties dosiero mankas

source: searching %s for license tags
eo: serĉante permesiletikedojn en %s

source: Could not resolve SPDX identifier of {path}, resolving to {identifier}
eo: Ne povis determini SPD-identigilo de {path}, do uziĝas {identifier}

source: {identifier} is the SPDX identifier of both {path} and {other_path}
eo: {identifier} estas la SPDX-identigilo de kaj {path} kaj {other_path}

source: no debian/copyright file, or could not read it
eo: neniu debian/copyright dosiero, aŭ ne povis legi ĝin

source: debian/copyright has syntax errors
eo: debian/copyright enhavas sintakserarojn

source: reuse Copyright (C) 2017-2018 Free Software Foundation Europe e.V.
eo: reuse Kopirajto (C) 2017-2018 Free Software Foundation Europe e.V.

source: reuse is a tool for compliance with the REUSE Initiative recommendations. See <https://reuse.software/> for more information.
eo: reuse estas ilo por konformiĝo al la rekomendoj de Iniciato REUSE. Vidu <https://reuse.software/> por pli da informo.

source: reuse is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. reuse is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with reuse. If not, see <http://www.gnu.org/licenses/>.
eo: reuse estas libera programaro: vi povas ĝin pludistribui kaj/aŭ modifi je la kondiĉoj de la GNU Ĝenerala Pubika Permesilo, eldonita de la Free Software Foundation, laŭ la versio 3 de la permesilo, aŭ (se vi preferas) ajna posta versio. Ni distribuas reuse esperante, ke ĝi estos utila, tamen SEN IA AJN GARANTIO, i.a. sen la implica garantio pri SURMERKATIGEBLO aŭ TAŬGECO POR IU KONKRETA CELO. Pliajn detalojn vidu en la GNU Ĝenerala Publika Permesilo. Ekzemplaro de la GNU Ĝenerala Publika Permesilo devas esti liverita al vi kun reuse. Se ne, vidu <http://www.gnu.org/licenses/>.

source: Support the FSFE's work:
eo: Subtenu la laboradon de FSFE:

source: Donations are critical to our strength and autonomy. They enable us to continue working for Free Software wherever necessary. Please consider making a donation at <https://fsfe.org/donate/>.
eo: Donacoj estas gravegaj por niaj forto kaj aŭtonomeco. Ili ebligas nin daŭrigi laboradon por libera programaro, kie ajn tio necesas. Bonvolu pripensi fari donacon ĉe <https://fsfe.org/donate/>.

source: IMPORTANT:
eo: GRAVA:

source: You do not have pygit2 installed. reuse will slow down significantly because of this. For better performance, please install your distribution's version of pygit2.
eo: Vi ne jam instalis pygit2. reuse malrapidiĝas ege pro ĉi tio. Por akiri pli bonan rendimenton, bonvolu instali version de pygit2 de via distribuo.

source: %s does not end with .spdx
eo: %s ne finiĝas per .spdx

source: %s is a directory
eo: %s estas dosierujo

source: could not read %s
eo: ne povis legi dosieron %s

source: none
eo: neniu

source: enable debug statements
eo: ŝalti sencimigajn ordonojn

source: do not use debian/copyright to extract reuse information
eo: ne uzi debian/copyright por eltiri reuse-informon

source: show program's version number and exit
eo: montri versionumeron de programo kaj eliri

source: print the project's bill of materials
eo: presi la pecoliston de la projekto

source: list all non-compliant files
eo: listigi ĉiujn nekonformajn dosierojn

source: List all non-compliant files. A file is non-compliant when: - It has no copyright information. - It has no license (declared as SPDX expression). - Its license could not be found. This prints only the paths of the files that do not comply, each file on a separate line. Error and warning messages are output to STDERR.
eo: Listigi ĉiujn nekonformajn dosierojn. Dosiero nekonformas kiam: - Ĝi havas neniun kopirajtinformon. - Ĝi havas neniun permesilon (deklaritan kiel SPDX-esprimo). - Ĝia permesilo ne troveblas. Ĉi tiu komando presas nur la dosierindikojn, kiuj ne konformas. Ĉiu dosiero estas presata sur propra linio. Eraraj kaj avertaj mesaĝoj estas presotaj al STDERR.

source: SPDX expressions are mandatory for compliance
eo: SPDX-esprimoj nepras por konformiĝo

source: copyright notices are mandatory for compliance
eo: kopirajtafiŝoj nepras por konformiĝo

source: ignore missing licenses
eo: ignori mankantajn permesilojn

source: print the SPDX expressions of each provided file
eo: presi la SPDX-esprimon de ĉiu donita dosiero

source: reuse, version {}
eo: reuse, versio {}

source: usage:
eo: uzo:

source: .__call__() not defined
eo: .__call__() ne difiniĝas

source: unknown parser %(parser_name)r (choices: %(choices)s)
eo: nekonata analizilo %(parser_name)r (elektoj: %(choices)s)

source: argument "-" with mode %r
eo: argumento "-" kun moduso %r

source: can't open '%s': %s
eo: ne povas malfermi '%s': %s

source: cannot merge actions - two groups are named %r
eo: ne povas kunigi agojn - du grupoj nomiĝas %r

source: 'required' is an invalid argument for positionals
eo: 'required' estas nevalida argumento por poziciaj

source: invalid option string %(option)r: must start with a character %(prefix_chars)r
eo: nevalida elektebla ĉeno %(option)r: devas komenciĝi per signo %(prefix_chars)r

source: dest= is required for options like %r
eo: dest= nepras por elektebloj kiel %r

source: invalid conflict_resolution value: %r
eo: nevalida valoro de conflict_resolution: %r

source: conflicting option string: %s
eo: konfliktanta elektebla ĉeno: %s

source: mutually exclusive arguments must be optional
eo: reciproke ekskluzivaj argumentoj devas esti malnepraj

source: positional arguments
eo: poziciaj argumentoj

source: optional arguments
eo: malnepraj argumentoj

source: show this help message and exit
eo: montri ĉi tiun helpmesaĝon kaj eliri

source: cannot have multiple subparser arguments
eo: ne povas havi plurajn subanalizilajn argumentojn

source: unrecognized arguments: %s
eo: nekonataj argumentoj: %s

source: not allowed with argument %s
eo: ne permesita kun argumento: %s

source: ignored explicit argument %r
eo: ignoris malimplicitan argumenton %r

source: the following arguments are required: %s
eo: la sekvaj argumentoj nepras: %s

source: one of the arguments %s is required
eo: unu el la argumentoj %s nepras

source: expected one argument
eo: atendis unu argumenton

source: expected at most one argument
eo: atendis maksimume unu argumenton

source: expected at least one argument
eo: atendis minimume unu argumenton

source: expected %s argument
eo: atendis %s argumenton

source: ambiguous option: %(option)s could match %(matches)s
eo: dubsenca elekteblo: %(option)s povus egali al %(matches)s

source: unexpected option string: %s
eo: neatendita elektebla ĉeno: %s

source: %r is not callable
eo: %r ne alvokeblas

source: invalid %(type)s value: %(value)r
eo: nevalida %(type)s-valoro: %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
eo: nevalida elekto: %(value)r (elektu el %(choices)s)

source: %(prog)s: error: %(message)s
eo: %(prog)s: eraro: %(message)s
