Repository: pypi-data/pypi-mirror-56
Catalog: packages/cubicweb-saem-ref/cubicweb-saem-ref-1.0.0.tar.gz/cubicweb-saem-ref-1.0.0/cubicweb_saem_ref/i18n/*.po
Languages: fr

source: %(ark)s already exists
fr: %(ark)s existe déjà

source: ARK Identifier - will be generated if not specified
fr: identifiant ARK - si non spécifié, il sera généré automatiquement

source: ARK identifier Name Assigning Authority (NAA)
fr: Autorité nommante ARK (NAA)

source: ARK identifier Name Assigning Authority (NAA) - you'll need one to start creating objects
fr: Autorité nommante ARK - nécessaire pour pouvoir créer des objets dans l'application

source: ARK identifier Name Assigning Authority (NAA), necessary to create ARK for concepts which don't have one yet.
fr: Autorité nommante ARK - nécessaire pour l'attribution d'ARK aux concepts n'en ayant pas

source: ARK name assigning authorities
fr: autorités nommantes ARK

source: Agent_plural
fr: Agents

source: An archival role determines the kind of action (e.g. deposit or control) an agent may perform on an archive entity.
fr: Un rôle archivistique détermine le type d'action (par ex. versement ou contrôle) qu'un agent peut réaliser sur une entité d'archive.

source: ArchivalRole
fr: Rôle archivistique

source: ArchivalRole_plural
fr: Rôles archivistiques

source: ArkNameAssigningAuthority
fr: Autorité nommante ARK

source: ArkNameAssigningAuthority_plural
fr: Autorités nommantes ARK

source: AuthorityRecord %s has several parents:
fr: La notice d'autorité %s a plusieurs parents :

source: ChronologicalRelation (predecessor)
fr: relation chronologique (prédécesseur)

source: ChronologicalRelation (successor)
fr: relation chronologique (successeur)

source: ChronologicalRelation_plural
fr: Relations chronologiques

source: Citation_plural
fr: Citations

source: Create one?
fr: En créer une ?

source: Edit authority settings
fr: Configurer l'autorité administrative

source: Edit your settings
fr: Éditer votre profil

source: HierarchicalRelation (child)
fr: relation hiérarchique (enfant)

source: HierarchicalRelation (parent)
fr: relation hiérarchique (parent)

source: HierarchicalRelation_plural
fr: Relations hiérarchiques

source: Import AuthorityRecord
fr: Importer une notice d'autorité

source: Import ConceptScheme
fr: Importer un vocabulaire contrôlé

source: Name Assigning Authority (NAA) for ARK generation.
fr: Autorité nommante (NAA) pour la génération d'identifiants ARK

source: Name Assigning Authority Number (NAAN)
fr: Numéro d'autorité nommante ARK (NAAN)

source: New Agent
fr: Nouvel agent

source: New ArchivalRole
fr: Nouveau rôle archivistique

source: New ArkNameAssigningAuthority
fr: Nouvelle autorité nommante ARK

source: New Organization
fr: Nouvelle autorité administrative

source: New OrganizationUnit
fr: Nouvelle unité administrative

source: No entity of type "{etype}" yet.
fr: Aucune entité de type "{etype}" pour l'instant.

source: Organization
fr: Autorité administrative

source: OrganizationUnit
fr: Unité administrative

source: OrganizationUnit_plural
fr: Unités administrative

source: Organization_plural
fr: Autorités administratives

source: Organization_plural_short
fr: Autorités admin.

source: Related versions
fr: Versions associées

source: SEDA components
fr: Unités d'archives

source: Search %s to link to the organization unit
fr: Recherche de %s à lier à l'unité administrative

source: Similar entities:
fr: Entités similaires :

source: Site information
fr: informations sur le site

source: This Agent
fr: Cet agent

source: This Agent:
fr: Cet agent :

source: This ArchivalRole
fr: Ce rôle archivistique

source: This ArchivalRole:
fr: Ce rôle archivistique :

source: This ArkNameAssigningAuthority
fr: Cette autorité nommante ARK

source: This ArkNameAssigningAuthority:
fr: Cette autorité nommante ARK :

source: This Organization
fr: Cette autorité administrative

source: This Organization:
fr: Cette autorité administrative :

source: This OrganizationUnit
fr: Cette unité administrative

source: This OrganizationUnit:
fr: Cette unité administrative :

source: This record is used by a relation forbidding to change its type
fr: Cette notice est utilisée dans une relation qui empêche de modifier son type

source: View
fr: Voir

source: Vocabularies
fr: Vocabulaires

source: You can't add authority record to organization unit without the 'archival' role.
fr: Seules les unités ayant le rôle 'service d'archives' peuvent référencer les notices d'autorité

source: You can't add profiles or concept schemes to organization unit without the 'deposit' role.
fr: Vous ne pouvez pas ajouter de vocabulaire ou de profil à une unité administrative qui n'a pas le rôle 'service versant'.

source: You must be in an organization to access this functionnality.
fr: Vous devez appartenir à une autorité administrative pour accéder à cette fonctionnalité.

source: Your organization must have an NAA configured to access this functionnality.
fr: Votre autorité administrative doit être associée à une autorité de nommage pour accéder à cette functionnalité.

source: add a Agent
fr: ajouter un agent

source: add a ArkNameAssigningAuthority
fr: ajouter une autorité nommante ARK

# inlined:Agent.use_email.subject
source: add a EmailAddress
fr: ajouter une adresse email

source: add a Organization
fr: ajouter une autorité administrative

# inlined:Agent.phone_number.subject
source: add a PhoneNumber
fr: ajouter un numéro de téléphone

source: added
fr: ajout

source: agent_role
fr: rôle de l'agent

source: agent_user
fr: utilisateur

source: agent_user_object
fr: agent

source: an ARK identifier has to be generated but no Name Assigning Authority is specified
fr: un identifiant ARK doit être généré mais aucune autorité d'affectation n'est spécifiée

source: archival
fr: service d'archives

source: archival_authority
fr: autorité d'archivage

source: archival_authority_object
fr: autorité d'archivage de

source: archival_role
fr: rôle archivistique

source: archival_role_object
fr: agent avec ce rôle

source: archival_unit
fr: service d'archives

source: archival_unit_object
fr: service d'archives pour

source: ark
fr: identifiant ARK

source: ark_naa
fr: autorité nommante ARK

source: ark_naa_object
fr: utilisé par

source: associated with
fr: responsable

# CWUser
source: associated_with_object
fr: responsable de

source: authority
fr: collectivité

# Agent
source: authority
fr: autorité administrative

# CWUser
source: authority
fr: autorité administrative

# OrganizationUnit
source: authority
fr: autorité administrative

source: authority records used by this archival unit
fr: notices d'autorité utilisées par ce service d'archive

source: authority_object
fr: autorité de

source: authority_record
fr: notice d'autorité

source: authority_record_object
fr: notice d'autorité de

source: can not process %s: expected format dd/mm/yyyy, mm/yyyy or yyyy
fr: %s n'est pas une date valide : format attendu jj/mm/aaaa, mm/aaaa ou aaaa

source: children
fr: enfants

source: chronological_predecessor
fr: prédécesseur

source: chronological_successor
fr: successeur

source: concept schemes used by the agent
fr: vocabulaires associés à l'agent

source: contact_point
fr: contact référent

source: contact_point_object
fr: point de contact de

source: control
fr: service de contrôle

source: created
fr: création

source: creating Agent (Agent authority Organization %(linkto)s)
fr: création d'un agent dans l'autorité administrative %(linkto)s

source: creating AgentFunction (AgentFunction function_agent AuthorityRecord %(linkto)s)
fr: création d'une fonction (pour la notice %(linkto)s)

source: creating AgentPlace (AgentPlace place_agent AuthorityRecord %(linkto)s)
fr: création d'un lieu (pour la notice %(linkto)s)

source: creating AssociationRelation (AssociationRelation association_from AuthorityRecord %(linkto)s)
fr: création d'une relation d'association (depuis %(linkto)s)

source: creating ChronologicalRelation (ChronologicalRelation chronological_predecessor AuthorityRecord %(linkto)s)
fr: création d'une relation chronologique (avec pour prédécesseur %(linkto)s)

source: creating ChronologicalRelation (ChronologicalRelation chronological_successor AuthorityRecord %(linkto)s)
fr: création d'une relation chronologique (avec pour successeur %(linkto)s)

source: creating EACOtherRecordId (EACOtherRecordId eac_other_record_id_of AuthorityRecord %(linkto)s)
fr: création d'un identifiant alternatif pour la notice %(linkto)s

source: creating EACResourceRelation (EACResourceRelation resource_relation_agent AuthorityRecord %(linkto)s)
fr: création d'une relation vers une ressource (pour la notice %(linkto)s)

source: creating EACSource (EACSource source_agent AuthorityRecord %(linkto)s)
fr: création d'une source (pour la notice %(linkto)s)

source: creating GeneralContext (GeneralContext general_context_of AuthorityRecord %(linkto)s)
fr: création d'un contexte général (pour la notice %(linkto)s)

source: creating HierarchicalRelation (HierarchicalRelation hierarchical_child AuthorityRecord %(linkto)s)
fr: création d'une relation hiérarchique (avec pour enfant %(linkto)s)

source: creating HierarchicalRelation (HierarchicalRelation hierarchical_parent AuthorityRecord %(linkto)s)
fr: création d'une relation hiérarchique (avec pour parent %(linkto)s)

source: creating History (History history_agent AuthorityRecord %(linkto)s)
fr: création d'un élément d'information historique (pour la notice %(linkto)s)

source: creating LegalStatus (LegalStatus legal_status_agent AuthorityRecord %(linkto)s)
fr: création d'un statut juridique (pour la notice %(linkto)s)

source: creating Mandate (Mandate mandate_agent AuthorityRecord %(linkto)s)
fr: création d'un texte de référence (pour la notice %(linkto)s)

source: creating Occupation (Occupation occupation_agent AuthorityRecord %(linkto)s)
fr: création d'une profession (pour la notice %(linkto)s)

source: creating OrganizationUnit (OrganizationUnit authority Organization %(linkto)s)
fr: création d'une unité dans l'autorité administrative %(linkto)s

source: creating Structure (Structure structure_agent AuthorityRecord %(linkto)s)
fr: création d'un élément d'organisation interne pour la notice %(linkto)s

source: cwuri
fr: URI

source: day is out of range for month
fr: Le jour demandé n'existe pas dans ce mois

source: delete
fr: supprimer

source: deposit
fr: service versant

source: deprecate
fr: déprécier

source: deprecated
fr: déprécié

source: draft
fr: brouillon

source: edit
fr: éditer

source: enquirer
fr: service demandeur

source: index
fr: indice

source: index of entity as an item of the collection of similar entities related to a given authority record
fr: indice de l'entité en tant qu'élément d'une collection d'entités similaires reliées à une notice d'autorité donnée

source: latest update on
fr: dernière mise à jour

source: malformatted ARK idenfitier %(ark)s (expecting [ark:/]NAAN/Name[Qualifier])
fr: identifiant ARK mal formé %(ark)s (attendu [ark:/]NAAN/Name[Qualifier])

source: modified
fr: modification

source: month must be in 1..12
fr: le mois doit être compris entre 1 et 12

# Agent
source: name
fr: nom

# ArchivalRole
source: name
fr: intitulé

# Organization
source: name
fr: nom

# OrganizationUnit
source: name
fr: nom

source: new version
fr: nouvelle version

source: new_version_of
fr: remplace

source: new_version_of_object
fr: remplacé par

source: no entity
fr: aucune entité

source: official organization name
fr: nom officiel de l'organisation

source: phone_number
fr: numéros de téléphone

source: phone_number_object
fr: notice

source: predecessors
fr: prédécesseurs

source: producer
fr: service producteur

source: publish
fr: publier

source: published
fr: publié

source: recently modified entities
fr: entités récemment modifiées

source: related_concept_scheme
fr: vocabulaires

source: related_concept_scheme_object
fr: utilisé par

source: removed
fr: suppression

source: saem.lifecycle_tab
fr: cycle de vie

source: saem_authorityrecord_description_tab
fr: description

source: saem_authorityrecord_general_information_tab
fr: informations générales

source: saem_authorityrecord_properties_tab
fr: propriétés

source: saem_authorityrecord_relations_tab
fr: relations

source: saem_org_agent_tab
fr: agents

source: saem_org_orgunit_tab
fr: unités administratives

source: saem_ou_authorityrecords_tab
fr: notices d'autorité utilisées

source: saem_ou_concepts_profiles_tab
fr: vocabulaires/profils

source: search for concepts of concept schemes
fr: rechercher parmi les concepts des vocabulaires contrôlés

source: seda-actor
fr: acteur SEDA

source: set an agent as the contact point of an organization unit
fr: définit un agent en tant que point de contact d'une unité administrative

source: successors
fr: successeurs

source: the application user related to this agent
fr: l'utilisateur de la plateforme relié à cet agent

source: the archival unit responsible for dealing with the organization's documents
fr: service d'archive compétent pour traiter les documents de l'autorité administrative

source: the authority record describing this agent
fr: la notice d'autorité décrivant cette agent

source: the authority record describing this organization
fr: la notice d'autorité décrivant cette autorité administrative

source: the authority record describing this organization unit
fr: la notice d'autorité décrivant cette unité admninistrative

source: the organization unit's archival role (producer, control, etc.)
fr: le rôle archivistique (producteur, de contrôle, etc.) de l'unité administrative

source: this concept scheme is used in at least one SEDA constraint
fr: ce vocabulaire est utilisé pour au moins une contrainte SEDA

source: this organization unit is the archival unit of some organization, therefore the role "archival" cannot be deleted
fr: cette unité administrative est le service d'archive d'au moins une organisation, le rôle "service d'archive" ne peut donc pas être supprimé

source: timezone in which time should be displayed
fr: fuseau horaire pour l'affichage du temps

source: use_authorityrecord
fr: utilise les notices d'autorité

source: use_authorityrecord_object
fr: utilisée par

source: use_profile
fr: profils SEDA

source: use_profile_object
fr: utilisé par

source: view
fr: voir

source: vocabulary_source
fr: source du vocabulaire

source: what
fr: quoi

source: when linked to a vocabulary, the value is enforced to the label of a concept in this vocabulary. Remove the vocabulary source if you want to type text freely.
fr: quand une source de vocabulaire est sélectionnée, la valeur de ce champ doit correspondre au libellé d'un concept du vocabulaire - déselectionnez la source de vocabulaire si vous voulez taper du texte librement

source: who
fr: qui
