Repository: pypi-data/pypi-mirror-56
Catalog: packages/reuse/reuse-0.7.0.tar.gz/reuse-0.7.0/po/*.po
Languages: es

source: could not find Git
es: no puedo encontrar Git

source: yielding %s
es: apuntando a %s

source: currently walking in %s
es: actualmente recorriendo %s

source: ignoring %s
es: ignorando %s

source: searching %s for reuse information
es: buscando información de reuse en %s

source: %s could not be decoded
es: %s no se pudo decodificar

source: %s covered by debian/copyright
es: %s cubierto por debian/copyright

source: Could not read %s
es: No se pudo leer %s

source: {path} is licensed under {identifier}, but its license file could not be found
es: {path} con licencia {identifier}, pero no se encontró el archivo con la licencia

source: searching %s for license tags
es: buscando etiquetas de licencia en %s

source: Could not resolve SPDX identifier of {path}, resolving to {identifier}
es: No se pudo resolver el identificador SPDX de {path}, resolviendo a {identifier}

source: {identifier} is the SPDX identifier of both {path} and {other_path}
es: {identifier} es el identificador SPDX tanto de {path} como de {other_path}

source: no debian/copyright file, or could not read it
es: no existe o no se pudo leer el archivo debian/copyright

source: debian/copyright has syntax errors
es: debian/copyright tiene errores de sintaxis

source: reuse Copyright (C) 2017-2018 Free Software Foundation Europe e.V.
es: Copyright (C) 2017-2018 de reuse Free Software Foundation Europe e.V.

source: reuse is a tool for compliance with the REUSE Initiative recommendations. See <https://reuse.software/> for more information.
es: reuse is una herramienta para cumplir con las recomendaciones de la iniciativa REUSE. Más información en <https://reuse.software/>.

source: reuse is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. reuse is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with reuse. If not, see <http://www.gnu.org/licenses/>.
es: reuse es software libre: puedes redistribuirlo y/o modificarlo bajo los términos de la Licencia Pública General GNU (GNU GPL) tal y como está publicada por la Free Software Foundation, tanto la versión 3 de la Licencia, o (a tu elección) cualquier versión posterior. reuse se distribuye con la esperanza de ser útil, pero SIN NINGUNA GARANTIA; ni siquiera la garantia implícita de COMERCIABILIDAD o ADECUACIÓN PARA UN PROPÓSITO PARTICULAR. Consulta la Licencia Pública General GNU para más detalles. Deberías haber recibido una copia de la Licencia Pública General GNU con reuse. Si no es así, consulta <http://www.gnu.org/licenses/>.

source: Support the FSFE's work:
es: Apoya el trabajo de la FSFE:

source: Donations are critical to our strength and autonomy. They enable us to continue working for Free Software wherever necessary. Please consider making a donation at <https://fsfe.org/donate/>.
es: Las donaciones son esenciales para nuestra fortaleza y autonomía. Nos permiten continuar trabajando por el Software Libre allá donde sea necesario. Por favor, considera hacer una donación en <https://fsfe.org/donate/>.

source: IMPORTANT:
es: IMPORTANTE:

source: You do not have pygit2 installed. reuse will slow down significantly because of this. For better performance, please install your distribution's version of pygit2.
es: No tienes instalado pygit2 por lo que reuse funcionará significativamente más lento. Por favor, instala la versión de pygit2 de tu distribución para un mejor rendimiento.

source: %s does not end with .spdx
es: %s no acaba en .spdx

source: %s is a directory
es: %s es un directorio

source: could not read %s
es: no se pudo leer %s

source: none
es: nada

source: enable debug statements
es: habilita instrucciones de depuración

source: do not use debian/copyright to extract reuse information
es: no use debian/copyright para extraer información de reuse

source: show program's version number and exit
es: muestra la versión del programa y sal

source: print the project's bill of materials
es: imprime la lista de materiales del proyecto

source: list all non-compliant files
es: lista todos los ficheros no compatibles

source: List all non-compliant files. A file is non-compliant when: - It has no copyright information. - It has no license (declared as SPDX expression). - Its license could not be found. This prints only the paths of the files that do not comply, each file on a separate line. Error and warning messages are output to STDERR.
es: Lista todos los ficheros no compatibles. Un fichero es no compatible si: - no tiene información de copyright. - no tiene licencia (declarada como una expresión SPDX). - su licencia no se encuentra. Esto imprime únicamente las rutas de los ficheros no compatibles, cada fichero en una línea separada. Los mensajes de error y aviso se muestran en STDERR.

source: SPDX expressions are mandatory for compliance
es: Las expresiones SPDX son de obligatorio cumplimiento

source: copyright notices are mandatory for compliance
es: las notas de copyright son de obligatorio cumplimiento

source: ignore missing licenses
es: ignora las licencias inexistentes

source: print the SPDX expressions of each provided file
es: imprime las expresiones SPDX de cada fichero proporcionado

source: reuse, version {}
es: reuse, versión {}

source: usage:
es: uso:

source: .__call__() not defined
es: .__call__() no está definido

source: unknown parser %(parser_name)r (choices: %(choices)s)
es: analizador gramatical desconocido %(parser_name)r (alternativas: %(choices)s)

source: argument "-" with mode %r
es: argumento "-" con modo %r

source: can't open '%s': %s
es: no se puede abrir '%s': %s

source: cannot merge actions - two groups are named %r
es: no se pueden fusionar las acciones - dos grupos se llaman %r

source: 'required' is an invalid argument for positionals
es: 'required' es un argumento inválido para posicionales

source: invalid option string %(option)r: must start with a character %(prefix_chars)r
es: cadena de opción inválida %(option)r: debe comenzar con un carácter %(prefix_chars)r

source: dest= is required for options like %r
es: se requiere dest= para opciones como %r

source: invalid conflict_resolution value: %r
es: valor inválido de conflict_resolution: %r

source: conflicting option string: %s
es: cadena de opción conflictiva: %s

source: mutually exclusive arguments must be optional
es: los argumentos mútuamente excluyentes deben ser opcionales

source: positional arguments
es: argumentos posicionales

source: optional arguments
es: argumentos opcionales

source: show this help message and exit
es: muestra este mensaje de ayuda y sal

source: cannot have multiple subparser arguments
es: no puede tener múltiples argumentos del subanalizador

source: unrecognized arguments: %s
es: argumentos irreconocibles: %s

source: not allowed with argument %s
es: no permitido con el argumento %s

source: ignored explicit argument %r
es: se ignora el argumento explicito %r

source: the following arguments are required: %s
es: se requiren los siguientes argumentos: %s

source: one of the arguments %s is required
es: se requiere uno de los argumentos %s

source: expected one argument
es: se espera un argumento

source: expected at most one argument
es: se espera un argumento como máximo

source: expected at least one argument
es: se espera un argumento como mínimo

source: expected %s argument
es: argumento %s esperado

source: ambiguous option: %(option)s could match %(matches)s
es: opción ambigua: %(option)s puede coincidir con %(matches)s

source: unexpected option string: %s
es: cadena de opción inesperada: %s

source: %r is not callable
es: %r no se puede invocar

source: invalid %(type)s value: %(value)r
es: valor inválido %(type)s: %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
es: elección inválida: %(value)r (elige entre %(choices)s)
