Repository: pypi-data/pypi-mirror-56
Catalog: packages/cubicweb-folder/cubicweb-folder-2.1.1.tar.gz/cubicweb-folder-2.1.1/cubicweb_folder/i18n/*.po
Languages: fr

source: Folder
fr: Dossier

source: Folder_plural
fr: Dossiers

source: New Folder
fr: Nouveau dossier

source: There is already a sibling folder named %s in the parent folder
fr: Il existe déjà un répertoire parallèle portant le nom %s

source: This Folder
fr: Ce dossier

source: add Folder filed_under Folder object
fr: sous-dossier

source: creating Folder (Folder filed_under Folder %(linkto)s)
fr: création sous-dossier de %(linkto)s

source: ctxcomponents_folderpathbar
fr: fil d'Ariane des dossiers

source: ctxcomponents_folderpathbar_description
fr: en-tête affichant la hiérarchie des dossiers dans lesquels est rangée l'entité visualisée

source: ctxcomponents_folders_box
fr: boite des dossiers

source: ctxcomponents_folders_box_description
fr: cette boite contient la liste des dossiers

# Folder
source: description_format
fr: format

source: filed_under
fr: dans le dossier

# Folder
source: filed_under
fr: dans le dossier

source: filed_under_object
fr: contient

# Folder
source: filed_under_object
fr: contient

source: folders are used to classify entities. They may be defined as a tree.
fr: les dossiers sont utilisés pour classifier des entités. Ils peuvent être définis de manière arborescente.

source: indicates that an entity is classified under a folder
fr: indiqiue qu'une entité est classée dans un dossier

# Folder
source: name
fr: nom

source: no folder available
fr: pas de dossier disponible

source: parent folder
fr: dossier parent

source: subfolders
fr: sous-répertoires
