Repository: pypi-data/pypi-mirror-56
Catalog: packages/TracVote/TracVote-0.7.0.tar.gz/TracVote-0.7.0/tracvote/locale/*/LC_MESSAGES/tracvote.po
Languages: es, ko

source: List of URL paths to allow voting on. Globs are supported.
es: Lista de URLs que permiten votar. Se aceptan globs.
ko: 투표를 허용할 URL 경로의 목록입니다. 아무개 문자 패턴을 사용할 수 있습니다.

source: Secure cookies are enabled, you must use https for your requests.
es: Estan activadas las cookies seguras, el uso de httpS es un requisito.
ko: 보안 쿠키가 활성화 되어 있으므로, 요청에 HTTPS를 사용해야 합니다.

source: Do you have cookies enabled?
es: ¿Has habilitado el uso de cookies?
ko: 쿠키가 활성화 되어 있습니까?

source: Show most recently voted resources.
es: Muesta los recursos que han sido votados recientemente.
ko: 최근에 투표된 리소스를 표시합니다.

source: Show listing of voted resources ordered by total score.
es: Ver la lista de recursos votados ordenados por puntos totales.
ko: 투표된 리소스의 목록을 총 점수 순으로 정렬하여 표시합니다.

source: Show listing of most recent votes for a resource.
es: Ver lista de vostos recientes por un recurso determinado.
ko: 리소스에 대한 최근 투표의 목록을 표시합니다.

source: by %(author)s at %(time)s
es: por %(author)s en %(time)s
ko: %(author)s 사용자가 %(time)s에 투표

source: at %(date)s
es: en fecha %(date)s
ko: %(date)s에

source: %(count)s by %(author)s %(vote)s
es: %(count)s de %(vote)s por %(author)s
ko: %(author)s 사용자가 %(vote)s %(count)s점을 투표

source: A newer version of VotePlugin has been installed before, but downgrading is unsupported.
es: Una versión más nueva de VotePlugin ya se encuentra instalada, no es posible instalar una anterior.
ko: 새 버전의 투표 플러그인이 설치된 적이 있으며, 다운그레이드는 지원하지 않습니다.

source: No upgrade module for version %(num)i (%(version)s.py)
es: No hay actualizaciones para la version %(num)i (%(version)s.py) del módulo
ko: 버전 %(num)i에 대한 업그레이드 모듈이 없습니다. (%(version)s.py)

source: Up-vote
es: Voto afirmativo
ko: 추천

source: Down-vote
es: Voto negativo
ko: 반대

source: You can vote for resources on this Trac install by clicking the up-vote/down-vote arrows in the context navigation bar.
es: Puedes votar por recursos a instalar en este Trac dando click en las flechas «Voto por sí/Voto por no» en la barrra de navegación contextual.
ko: 이 Trac에 있는 리소스에 대해 투표하려면, 상황에 맞는 메뉴에 표시되는 추천/반대 화살표를 누릅니다.

source: Vote count%(detail)s
es: Detalles de escrutinio de%(detail)s
ko: 투표 수%(detail)s

source: Unsupported database type "%s"
es: La base de datos "%s" no está soportada.
ko: 데이터베이스 형식 "%s"이(가) 지원되지 않습니다.
