Repository: pypi-data/pypi-mirror-56
Catalog: packages/giqra/giqra-1.2.tar.gz/giqra-1.2/giqra/res/plugin/translations/po/*/giqra.plugin.importdb.po
Languages: ar

source: importdb
ar: استيراد قاعدة بيانات

source: Import Database
ar: استورد قاعدة بيانات

source: Automatically guess version
ar: توقع الإصدار آليا

source: Include libraries
ar: ضمن المكتبات

source: Include authors
ar: ضمن المؤلفين

source: Include publishers
ar: ضمن الناشرين

source: Include sections
ar: ضمن الفروع

source: Include books
ar: ضمن الكتب

source: Include borrows
ar: ضمن الاستعارات

source: Open File
ar: افتح الملف
