Repository: pypi-data/pypi-mirror-56
Catalog: packages/collective.iamisearch/collective.iamisearch-1.1.tar.gz/collective.iamisearch-1.1/src/collective/iamisearch/locales/*/LC_MESSAGES/collective.iamisearch.po
Languages: fr

source: Descriptions to show above I am faceted search
fr: Descriptions à afficher au-dessus des recherches Je suis

source: Descriptions to show above I search faceted search
fr: Descriptions à afficher au-dessus des recherches Je trouve

source: I am
fr: Je suis

source: I am / I seach
fr: Je suis / Je trouve

source: I am / I search settings
fr: Paramètres Je suis / Je trouve

source: I am Term
fr: Valeur de Je suis

source: I search
fr: Je trouve

source: I search Term
fr: Valeur de Je trouve

source: Language
fr: Langue

source: Value
fr: Valeur
